#include <stdio.h>

int main() {
	printf("Hello World!\n");

	// 깃 커밋 습관
	/*
		1. 자주 커밋하여 변경 사항 기록
		2. 한 번에 하나의 기능 또는 수정 사항 커밋
			- 코드 설명 남기기
			예) [학습 내용] if문 조건문
				[실수] = 대신 == 써야 함
				Day01: printf 출력 추가
				Day01: 변수 선언 및 초기화 추가
				Day01: 사용자 입력 scanf 연습 완료

				틀린 코드도 남기기: 실패 코드[논리 오류, if (a = 10)]

			- 커밋 메시지에 변경 사항 요약
			예) 이슈 번호 또는 참조, 작성자 이름과 날짜 포함
				변경 사항의 이유, 영향 범위, 테스트 방법 설명

			- 커밋 메시지 형식 일관성 유지: 제목과 본문 구분, 명령형 시제 사용, 50자 이내 제목 작성
			- 커밋 메시지 작성 시 주의 사항: 불필요한 정보 포함X, 명확하고 간결하게 작성, 변경 사항의 이유와 영향 설명
			
			- 커밋 메시지 작성 도구 활용: Git GUI, IDE 통합 도구, 커맨드 라인 인터페이스 등
			- 커밋 메시지 작성 후 검토: 변경 사항과 메시지 내용이 일치하는지, 오타나 문법 오류 없는지 확인,
				팀원과 공유하여 피드백 받기

		*/

	return 0;
}